In [48]:
import numpy as np
import pandas as pd

## Basic data structures in pandas

Pandas provides two types of classes for handling data:

1. Series: **a one-dimensional labeled array holding data of any type**
such as integers, strings, Python objects etc.

2. DataFrame: a two-dimensional data structure that holds data like a two-dimension array or a table with rows and columns.

## Object creation

Creating a ***Series*** by passing a list of values, letting pandas create a default ***RangeIndex***.

In [49]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])

In [50]:
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [51]:
s.index

RangeIndex(start=0, stop=6, step=1)

Creating a ***DataFrame*** by passing a NumPy array with a datetime index using ***date_range()*** and labeled columns:

In [52]:
dates = pd.date_range("20130101", periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [53]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=list("ABCD"))
df

                   A         B         C         D
2013-01-01 -0.608275  1.447190  0.163393  1.451514
2013-01-02 -1.861249 -0.780023 -0.547336  1.455371
2013-01-03  0.364616  1.191336  0.142321 -0.898167
2013-01-04  0.194420 -0.675818  0.487371 -0.641354
2013-01-05  1.023516 -0.405656 -2.434327 -1.171681
2013-01-06  0.929444 -0.977844 -0.461123  1.230975

Creating a **DataFrame** by passing a dictionary of objects where the keys are the column labels and the values are the column values.

In [54]:
df2 = pd.DataFrame(
    {
        "A": 1.0,
        "B": pd.Timestamp("20130102"),
        "C": pd.Series(1, index=list(range(4)), dtype="float32"),
        "D": np.array([3] * 4, dtype="int32"),
        "E": pd.Categorical(["test", "train", "test", "train"]),
        "F": "foo",
    }
)
df2

     A          B    C  D      E    F
0  1.0 2013-01-02  1.0  3   test  foo
1  1.0 2013-01-02  1.0  3  train  foo
2  1.0 2013-01-02  1.0  3   test  foo
3  1.0 2013-01-02  1.0  3  train  foo

The columns of the resulting **DataFrame** have different **dtypes**:

In [55]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

## Viewing data
Use **DataFrame.head()** and **DataFrame.tail()** to view the top and bottom rows of the frame respectively:

In [56]:
df.head()

                   A         B         C         D
2013-01-01 -0.608275  1.447190  0.163393  1.451514
2013-01-02 -1.861249 -0.780023 -0.547336  1.455371
2013-01-03  0.364616  1.191336  0.142321 -0.898167
2013-01-04  0.194420 -0.675818  0.487371 -0.641354
2013-01-05  1.023516 -0.405656 -2.434327 -1.171681

In [57]:
df.tail(3)

                   A         B         C         D
2013-01-04  0.194420 -0.675818  0.487371 -0.641354
2013-01-05  1.023516 -0.405656 -2.434327 -1.171681
2013-01-06  0.929444 -0.977844 -0.461123  1.230975

Display the **DataFrame.index** or **DataFrame.columns**:

In [58]:
df.index

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [59]:
df.columns

Index(['A', 'B', 'C', 'D'], dtype='object')

Return a NumPy representation of the underlying data with **DataFrame.to_numpy()** without the index or column labels:

In [60]:
df.to_numpy()

array([[-0.60827537,  1.4471897 ,  0.16339348,  1.45151446],
       [-1.86124898, -0.78002292, -0.54733644,  1.45537145],
       [ 0.36461599,  1.191336  ,  0.14232079, -0.89816665],
       [ 0.19442046, -0.67581785,  0.48737132, -0.64135351],
       [ 1.02351609, -0.40565585, -2.43432696, -1.17168055],
       [ 0.92944412, -0.97784351, -0.46112326,  1.23097494]])

**NumPy arrays have one dtype for the entire array while pandas DataFrames have one dtype per column.** When you call **DataFrame.to_numpy()**, pandas will find the NumPy dtype that can hold all of the dtypes in the DataFrame. If the common data type is object, DataFrame.to_numpy() will require copying data.

In [61]:
df2.dtypes

A          float64
B    datetime64[s]
C          float32
D            int32
E         category
F           object
dtype: object

In [62]:
df2.to_numpy()

array([[1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'test', 'foo'],
       [1.0, Timestamp('2013-01-02 00:00:00'), 1.0, 3, 'train', 'foo']],
      dtype=object)

**describe()** shows a quick statistic summary of your data:

In [63]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean   0.007079 -0.033469 -0.441617  0.237777
std    1.087763  1.067035  1.053802  1.264274
min   -1.861249 -0.977844 -2.434327 -1.171681
25%   -0.407601 -0.753972 -0.525783 -0.833963
50%    0.279518 -0.540737 -0.159401  0.294811
75%    0.788237  0.792088  0.158125  1.396380
max    1.023516  1.447190  0.487371  1.455371

Transposing your data:

In [64]:
df.T

   2013-01-01  2013-01-02  2013-01-03  2013-01-04  2013-01-05  2013-01-06
A   -0.608275   -1.861249    0.364616    0.194420    1.023516    0.929444
B    1.447190   -0.780023    1.191336   -0.675818   -0.405656   -0.977844
C    0.163393   -0.547336    0.142321    0.487371   -2.434327   -0.461123
D    1.451514    1.455371   -0.898167   -0.641354   -1.171681    1.230975

**DataFrame.sort_index()** sorts by an axis:

In [65]:
df.sort_index(axis=1, ascending=False)

                   D         C         B         A
2013-01-01  1.451514  0.163393  1.447190 -0.608275
2013-01-02  1.455371 -0.547336 -0.780023 -1.861249
2013-01-03 -0.898167  0.142321  1.191336  0.364616
2013-01-04 -0.641354  0.487371 -0.675818  0.194420
2013-01-05 -1.171681 -2.434327 -0.405656  1.023516
2013-01-06  1.230975 -0.461123 -0.977844  0.929444

**DataFrame.sort_values()** sorts by values:

In [66]:
df.sort_values(by="B")

                   A         B         C         D
2013-01-06  0.929444 -0.977844 -0.461123  1.230975
2013-01-02 -1.861249 -0.780023 -0.547336  1.455371
2013-01-04  0.194420 -0.675818  0.487371 -0.641354
2013-01-05  1.023516 -0.405656 -2.434327 -1.171681
2013-01-03  0.364616  1.191336  0.142321 -0.898167
2013-01-01 -0.608275  1.447190  0.163393  1.451514

## Getitem ([])

For a **DataFrame**, passing a single label selects a columns and yields a **Series** equivalent to **df.A**:

In [67]:
df["A"]

2013-01-01   -0.608275
2013-01-02   -1.861249
2013-01-03    0.364616
2013-01-04    0.194420
2013-01-05    1.023516
2013-01-06    0.929444
Freq: D, Name: A, dtype: float64

For a **DataFrame**, passing a slice **:** selects matching rows:

In [68]:
df[0:3]

                   A         B         C         D
2013-01-01 -0.608275  1.447190  0.163393  1.451514
2013-01-02 -1.861249 -0.780023 -0.547336  1.455371
2013-01-03  0.364616  1.191336  0.142321 -0.898167

In [69]:
df["20130102":"20130104"]

                   A         B         C         D
2013-01-02 -1.861249 -0.780023 -0.547336  1.455371
2013-01-03  0.364616  1.191336  0.142321 -0.898167
2013-01-04  0.194420 -0.675818  0.487371 -0.641354

## Selection by label
Selecting a row matching a label:

In [70]:
df.loc[dates[0]]

A   -0.608275
B    1.447190
C    0.163393
D    1.451514
Name: 2013-01-01 00:00:00, dtype: float64

Selecting all rows (:) with a select column labels:

In [71]:
df.loc[:, ["A", "B"]]

                   A         B
2013-01-01 -0.608275  1.447190
2013-01-02 -1.861249 -0.780023
2013-01-03  0.364616  1.191336
2013-01-04  0.194420 -0.675818
2013-01-05  1.023516 -0.405656
2013-01-06  0.929444 -0.977844

For label slicing, both endpoints are included:

In [72]:
df.loc["20130102":"20130104", ["A", "B"]]

                   A         B
2013-01-02 -1.861249 -0.780023
2013-01-03  0.364616  1.191336
2013-01-04  0.194420 -0.675818

Selecting a single row and column label returns a scalar:

In [73]:
df.loc[dates[0], "A"]

-0.6082753723317702

For getting fast access to a scalar (equivalent to the prior method):

In [74]:
df.at[dates[0], "A"]

-0.6082753723317702

## Selection by position

Select via the position of the passed integers:

In [75]:
df.iloc[3]

A    0.194420
B   -0.675818
C    0.487371
D   -0.641354
Name: 2013-01-04 00:00:00, dtype: float64

Integer slices acts similar to NumPy/Python:

In [76]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04  0.194420 -0.675818
2013-01-05  1.023516 -0.405656

Lists of integer position locations:

In [77]:
df.iloc[[1, 2, 4], [0, 2]]

                   A         C
2013-01-02 -1.861249 -0.547336
2013-01-03  0.364616  0.142321
2013-01-05  1.023516 -2.434327

For slicing rows explicitly:

In [78]:
df.iloc[1:3, :]

                   A         B         C         D
2013-01-02 -1.861249 -0.780023 -0.547336  1.455371
2013-01-03  0.364616  1.191336  0.142321 -0.898167

For slicing columns explicitly:

In [79]:
df.iloc[:, 1:3]

                   B         C
2013-01-01  1.447190  0.163393
2013-01-02 -0.780023 -0.547336
2013-01-03  1.191336  0.142321
2013-01-04 -0.675818  0.487371
2013-01-05 -0.405656 -2.434327
2013-01-06 -0.977844 -0.461123

For getting a value explicitly:

In [80]:
df.iloc[1, 1]

-0.7800229207155166

For getting fast access to a scalar (equivalent to the prior method):

In [81]:
df.iat[1, 1]

-0.7800229207155166

## Boolean indexing
Select rows where **df.A** is greater than 0.

In [82]:
df[df["A"] > 0]

                   A         B         C         D
2013-01-03  0.364616  1.191336  0.142321 -0.898167
2013-01-04  0.194420 -0.675818  0.487371 -0.641354
2013-01-05  1.023516 -0.405656 -2.434327 -1.171681
2013-01-06  0.929444 -0.977844 -0.461123  1.230975

Selecting values from a DataFrame where a boolean condition is met:

In [83]:
df[df > 0]

                   A         B         C         D
2013-01-01       NaN  1.447190  0.163393  1.451514
2013-01-02       NaN       NaN       NaN  1.455371
2013-01-03  0.364616  1.191336  0.142321       NaN
2013-01-04  0.194420       NaN  0.487371       NaN
2013-01-05  1.023516       NaN       NaN       NaN
2013-01-06  0.929444       NaN       NaN  1.230975

Using **isin()** method for filtering:

In [84]:
df2 = df.copy()

In [85]:
df2["E"] = ["one", "one", "two", "three", "four", "three"]

In [86]:
df2

                   A         B         C         D      E
2013-01-01 -0.608275  1.447190  0.163393  1.451514    one
2013-01-02 -1.861249 -0.780023 -0.547336  1.455371    one
2013-01-03  0.364616  1.191336  0.142321 -0.898167    two
2013-01-04  0.194420 -0.675818  0.487371 -0.641354  three
2013-01-05  1.023516 -0.405656 -2.434327 -1.171681   four
2013-01-06  0.929444 -0.977844 -0.461123  1.230975  three

In [87]:
df2[df2["E"].isin(["two", "four"])]

                   A         B         C         D     E
2013-01-03  0.364616  1.191336  0.142321 -0.898167   two
2013-01-05  1.023516 -0.405656 -2.434327 -1.171681  four

## Setting
Setting a new column automatically aligns the data by the indexes:

In [88]:
s1 = pd.Series([1, 2, 3, 4, 5, 6], index=pd.date_range("20130102", periods=6))
s1

2013-01-02    1
2013-01-03    2
2013-01-04    3
2013-01-05    4
2013-01-06    5
2013-01-07    6
Freq: D, dtype: int64

Setting values by label:

In [89]:
df.at[dates[0], "A"] = 0
df

                   A         B         C         D
2013-01-01  0.000000  1.447190  0.163393  1.451514
2013-01-02 -1.861249 -0.780023 -0.547336  1.455371
2013-01-03  0.364616  1.191336  0.142321 -0.898167
2013-01-04  0.194420 -0.675818  0.487371 -0.641354
2013-01-05  1.023516 -0.405656 -2.434327 -1.171681
2013-01-06  0.929444 -0.977844 -0.461123  1.230975

Setting values by position:

In [90]:
df.iat[0, 1] = 0
df

                   A         B         C         D
2013-01-01  0.000000  0.000000  0.163393  1.451514
2013-01-02 -1.861249 -0.780023 -0.547336  1.455371
2013-01-03  0.364616  1.191336  0.142321 -0.898167
2013-01-04  0.194420 -0.675818  0.487371 -0.641354
2013-01-05  1.023516 -0.405656 -2.434327 -1.171681
2013-01-06  0.929444 -0.977844 -0.461123  1.230975

Setting by assigning with a NumPy array:

In [91]:
df.loc[:, "D"] = np.array([5] * len(df))
df

                   A         B         C    D
2013-01-01  0.000000  0.000000  0.163393  5.0
2013-01-02 -1.861249 -0.780023 -0.547336  5.0
2013-01-03  0.364616  1.191336  0.142321  5.0
2013-01-04  0.194420 -0.675818  0.487371  5.0
2013-01-05  1.023516 -0.405656 -2.434327  5.0
2013-01-06  0.929444 -0.977844 -0.461123  5.0

A where operation with setting:

In [94]:
df2 = df.copy()

In [95]:
df2[df2 > 0] = -df2
df

                   A         B         C    D
2013-01-01  0.000000  0.000000  0.163393  5.0
2013-01-02 -1.861249 -0.780023 -0.547336  5.0
2013-01-03  0.364616  1.191336  0.142321  5.0
2013-01-04  0.194420 -0.675818  0.487371  5.0
2013-01-05  1.023516 -0.405656 -2.434327  5.0
2013-01-06  0.929444 -0.977844 -0.461123  5.0

## Missing data
Reindexing allows you to change/add/delete the index on a specified axis. This returns a copy of the data:

In [96]:
df1 = df.reindex(index=dates[0:4], columns=list(df.columns) + ["E"])
df1.loc[dates[0] : dates[1], "E"] = 1
df1

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  0.163393  5.0  1.0
2013-01-02 -1.861249 -0.780023 -0.547336  5.0  1.0
2013-01-03  0.364616  1.191336  0.142321  5.0  NaN
2013-01-04  0.194420 -0.675818  0.487371  5.0  NaN

**DataFrame.dropna()** drops any rows that have missing data:

In [98]:
df1.dropna(how="any")

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  0.163393  5.0  1.0
2013-01-02 -1.861249 -0.780023 -0.547336  5.0  1.0

**DataFrame.fillna()** fills missing data:

In [99]:
df1.fillna(value=5)

                   A         B         C    D    E
2013-01-01  0.000000  0.000000  0.163393  5.0  1.0
2013-01-02 -1.861249 -0.780023 -0.547336  5.0  1.0
2013-01-03  0.364616  1.191336  0.142321  5.0  5.0
2013-01-04  0.194420 -0.675818  0.487371  5.0  5.0

**isna()** gets the boolean mask where values are nan:

In [ ]:
pd.isna(df1)

## Stats
Operations in general exclude missing data.

Calculate the mean value for each column:

In [101]:
df

                   A         B         C    D
2013-01-01  0.000000  0.000000  0.163393  5.0
2013-01-02 -1.861249 -0.780023 -0.547336  5.0
2013-01-03  0.364616  1.191336  0.142321  5.0
2013-01-04  0.194420 -0.675818  0.487371  5.0
2013-01-05  1.023516 -0.405656 -2.434327  5.0
2013-01-06  0.929444 -0.977844 -0.461123  5.0

In [100]:
df.mean()

A    0.108458
B   -0.274667
C   -0.441617
D    5.000000
dtype: float64

Calculate the mean value for each row:

In [102]:
df.mean(axis=1)

2013-01-01    1.290848
2013-01-02    0.452848
2013-01-03    1.674568
2013-01-04    1.251493
2013-01-05    0.795883
2013-01-06    1.122619
Freq: D, dtype: float64

Operating with another Series or DataFrame with a different index or column will align the result with the union of the index or column labels. In addition, pandas automatically broadcasts along the specified dimension and will fill unaligned labels with **np.nan**.

In [103]:
s = pd.Series([1, 3, 5, np.nan, 6, 8], index=dates).shift(2)
s

2013-01-01    NaN
2013-01-02    NaN
2013-01-03    1.0
2013-01-04    3.0
2013-01-05    5.0
2013-01-06    NaN
Freq: D, dtype: float64

In [104]:
df.sub(s, axis="index")

                   A         B         C    D
2013-01-01       NaN       NaN       NaN  NaN
2013-01-02       NaN       NaN       NaN  NaN
2013-01-03 -0.635384  0.191336 -0.857679  4.0
2013-01-04 -2.805580 -3.675818 -2.512629  2.0
2013-01-05 -3.976484 -5.405656 -7.434327  0.0
2013-01-06       NaN       NaN       NaN  NaN

## User defined functions
**DataFrame.agg()** and **DataFrame.transform()** applies a user defined function that reduces or broadcasts its result respectively.

In [105]:
df.agg(lambda x: np.mean(x) * 5.6)

A     0.607365
B    -1.538137
C    -2.473054
D    28.000000
dtype: float64

In [106]:
df.transform(lambda x: x * 101.2)

                     A           B           C      D
2013-01-01    0.000000    0.000000   16.535420  506.0
2013-01-02 -188.358397  -78.938320  -55.390448  506.0
2013-01-03   36.899138  120.563203   14.402864  506.0
2013-01-04   19.675350  -68.392766   49.321978  506.0
2013-01-05  103.579828  -41.052372 -246.353888  506.0
2013-01-06   94.059745  -98.957764  -46.665673  506.0

## Value Counts

In [107]:
s = pd.Series(np.random.randint(0, 7, size=10))
s

0    2
1    0
2    4
3    4
4    5
5    1
6    3
7    4
8    2
9    6
dtype: int32

In [108]:
s.value_counts()

4    3
2    2
0    1
5    1
1    1
3    1
6    1
Name: count, dtype: int64

## String Methods
Series is equipped with a set of string processing methods in the str attribute that make it easy to operate on each element of the array, as in the code snippet below.

In [109]:
s = pd.Series(["A", "B", "C", "Aaba", "Baca", np.nan, "CABA", "dog", "cat"])
s.str.lower()

0       a
1       b
2       c
3    aaba
4    baca
5     NaN
6    caba
7     dog
8     cat
dtype: object

## Merge
### Concat
pandas provides various facilities for easily combining together Series and DataFrame objects with various kinds of set logic for the indexes and relational algebra functionality in the case of join / merge-type operations.

Concatenating pandas objects together row-wise with **concat()**:

In [110]:
df = pd.DataFrame(np.random.randn(10, 4))
df

          0         1         2         3
0 -0.215519  2.302224  0.051968 -0.204195
1  0.535873  0.925184 -1.081999  0.752152
2  1.439876 -1.178586  1.186191  0.774077
3 -0.438670  0.865674 -0.774492  0.445461
4 -0.618681  0.230839 -0.706163 -1.185569
5 -0.109625 -1.449565  0.260157  0.001137
6  0.643366 -0.184303 -1.309150  1.501511
7  1.363832 -0.464567 -1.184433 -0.326792
8  0.294002 -0.602297  1.642461  0.152134
9  1.633489 -1.595254 -0.460596  0.673411

In [111]:
pieces = [df[:3], df[3:7], df[7:]]
pieces

[          0         1         2         3
 0 -0.215519  2.302224  0.051968 -0.204195
 1  0.535873  0.925184 -1.081999  0.752152
 2  1.439876 -1.178586  1.186191  0.774077,
           0         1         2         3
 3 -0.438670  0.865674 -0.774492  0.445461
 4 -0.618681  0.230839 -0.706163 -1.185569
 5 -0.109625 -1.449565  0.260157  0.001137
 6  0.643366 -0.184303 -1.309150  1.501511,
           0         1         2         3
 7  1.363832 -0.464567 -1.184433 -0.326792
 8  0.294002 -0.602297  1.642461  0.152134
 9  1.633489 -1.595254 -0.460596  0.673411]

In [112]:
pd.concat(pieces)

          0         1         2         3
0 -0.215519  2.302224  0.051968 -0.204195
1  0.535873  0.925184 -1.081999  0.752152
2  1.439876 -1.178586  1.186191  0.774077
3 -0.438670  0.865674 -0.774492  0.445461
4 -0.618681  0.230839 -0.706163 -1.185569
5 -0.109625 -1.449565  0.260157  0.001137
6  0.643366 -0.184303 -1.309150  1.501511
7  1.363832 -0.464567 -1.184433 -0.326792
8  0.294002 -0.602297  1.642461  0.152134
9  1.633489 -1.595254 -0.460596  0.673411

## Join
**merge()** enables SQL style join types along specific columns.

In [113]:
left = pd.DataFrame({"key": ["foo", "foo"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  foo     2

In [114]:
right = pd.DataFrame({"key": ["foo", "foo"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  foo     5

In [115]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  foo     1     5
2  foo     2     4
3  foo     2     5

**merge()** on unique keys:

In [116]:
left = pd.DataFrame({"key": ["foo", "bar"], "lval": [1, 2]})
left

   key  lval
0  foo     1
1  bar     2

In [117]:
right = pd.DataFrame({"key": ["foo", "bar"], "rval": [4, 5]})
right

   key  rval
0  foo     4
1  bar     5

In [118]:
pd.merge(left, right, on="key")

   key  lval  rval
0  foo     1     4
1  bar     2     5

## Grouping
By "group by" we are referring to a process involving one or more of the following steps:

- **Splitting** the data into groups based on some criteria

- **Applying** a function to each group independently

- **Combining** the results into a data structure

In [119]:
df = pd.DataFrame(
    {
        "A": ["foo", "bar", "foo", "bar", "foo", "bar", "foo", "foo"],
        "B": ["one", "one", "two", "three", "two", "two", "one", "three"],
        "C": np.random.randn(8),
        "D": np.random.randn(8),
    }
)
df

     A      B         C         D
0  foo    one  0.182646  0.484607
1  bar    one -0.328482 -0.542645
2  foo    two -1.174426  0.986306
3  bar  three  1.019663  0.218445
4  foo    two  0.753862 -0.608833
5  bar    two -0.052095 -0.326310
6  foo    one -0.620473 -1.039065
7  foo  three  0.072190 -0.992503

Grouping by a column label, selecting column labels, and then applying the **DataFrameGroupBy.sum()** function to the resulting groups:

In [120]:
df.groupby("A")[["C", "D"]].sum()

            C         D
A
bar  0.639087 -0.650510
foo -0.786201 -1.169488

Grouping by multiple columns label forms MultiIndex.

In [121]:
df.groupby(["A", "B"]).sum()

                  C         D
A   B
bar one   -0.328482 -0.542645
    three  1.019663  0.218445
    two   -0.052095 -0.326310
foo one   -0.437827 -0.554458
    three  0.072190 -0.992503
    two   -0.420565  0.377473

## Reshaping
## Stack

In [124]:
arrays = [
   ["bar", "bar", "baz", "baz", "foo", "foo", "qux", "qux"],
   ["one", "two", "one", "two", "one", "two", "one", "two"],
]
index = pd.MultiIndex.from_arrays(arrays, names=["first", "second"])
df = pd.DataFrame(np.random.randn(8, 2), index=index, columns=["A", "B"])
df2 = df[:4]
df2

                     A         B
first second
bar   one    -0.605225 -0.373870
      two    -0.210820 -0.801543
baz   one     0.502327  0.061638
      two     2.391028  1.480139

The **stack()** method "compresses" a level in the DataFrame’s columns:

In [125]:
stacked = df2.stack(future_stack=True)
stacked

first  second
bar    one     A   -0.605225
               B   -0.373870
       two     A   -0.210820
               B   -0.801543
baz    one     A    0.502327
               B    0.061638
       two     A    2.391028
               B    1.480139
dtype: float64

With a "stacked" DataFrame or Series (having a MultiIndex as the index), the inverse operation of **stack()** is **unstack()**, which by default unstacks the **last level**:

In [126]:
stacked.unstack()

                     A         B
first second
bar   one    -0.605225 -0.373870
      two    -0.210820 -0.801543
baz   one     0.502327  0.061638
      two     2.391028  1.480139

In [127]:
stacked.unstack(1)

second        one       two
first
bar   A -0.605225 -0.210820
      B -0.373870 -0.801543
baz   A  0.502327  2.391028
      B  0.061638  1.480139

In [128]:
stacked.unstack(0)

first          bar       baz
second
one    A -0.605225  0.502327
       B -0.373870  0.061638
two    A -0.210820  2.391028
       B -0.801543  1.480139

## Pivot tables

In [129]:
df = pd.DataFrame(
    {
        "A": ["one", "one", "two", "three"] * 3,
        "B": ["A", "B", "C"] * 4,
        "C": ["foo", "foo", "foo", "bar", "bar", "bar"] * 2,
        "D": np.random.randn(12),
        "E": np.random.randn(12),
    }
)
df

        A  B    C         D         E
0     one  A  foo  1.840255 -0.313870
1     one  B  foo  0.500177 -1.816375
2     two  C  foo -0.566890 -1.071067
3   three  A  bar  0.663651 -0.251486
4     one  B  bar -0.052512  0.837599
5     one  C  bar  0.533901  0.870492
6     two  A  foo  1.036526 -0.247031
7   three  B  foo  0.692253  0.607253
8     one  C  foo  0.372585 -0.457292
9     one  A  bar  1.094678  0.475473
10    two  B  bar  0.989235  0.408372
11  three  C  bar -0.128367  2.374371

**pivot_table()** pivots a DataFrame specifying the values, index and columns

In [130]:
pd.pivot_table(df, values="D", index=["A", "B"], columns=["C"])

C             bar       foo
A     B
one   A  1.094678  1.840255
      B -0.052512  0.500177
      C  0.533901  0.372585
three A  0.663651       NaN
      B       NaN  0.692253
      C -0.128367       NaN
two   A       NaN  1.036526
      B  0.989235       NaN
      C       NaN -0.566890

## Time series

pandas has simple, powerful, and efficient functionality for performing resampling operations during frequency conversion (e.g., converting secondly data into 5-minutely data). This is extremely common in, but not limited to, financial applications.

In [131]:
rng = pd.date_range("1/1/2012", periods=100, freq="s")
rng

DatetimeIndex(['2012-01-01 00:00:00', '2012-01-01 00:00:01',
               '2012-01-01 00:00:02', '2012-01-01 00:00:03',
               '2012-01-01 00:00:04', '2012-01-01 00:00:05',
               '2012-01-01 00:00:06', '2012-01-01 00:00:07',
               '2012-01-01 00:00:08', '2012-01-01 00:00:09',
               '2012-01-01 00:00:10', '2012-01-01 00:00:11',
               '2012-01-01 00:00:12', '2012-01-01 00:00:13',
               '2012-01-01 00:00:14', '2012-01-01 00:00:15',
               '2012-01-01 00:00:16', '2012-01-01 00:00:17',
               '2012-01-01 00:00:18', '2012-01-01 00:00:19',
               '2012-01-01 00:00:20', '2012-01-01 00:00:21',
               '2012-01-01 00:00:22', '2012-01-01 00:00:23',
               '2012-01-01 00:00:24', '2012-01-01 00:00:25',
               '2012-01-01 00:00:26', '2012-01-01 00:00:27',
               '2012-01-01 00:00:28', '2012-01-01 00:00:29',
               '2012-01-01 00:00:30', '2012-01-01 00:00:31',
               '2012-01-01 00:00:32', '2012-01-01 00:00:33',
               '2012-01-01 00:00:34', '2012-01-01 00:00:35',
               '2012-01-01 00:00:36', '2012-01-01 00:00:37',
               '2012-01-01 00:00:38', '2012-01-01 00:00:39',
               '2012-01-01 00:00:40', '2012-01-01 00:00:41',
               '2012-01-01 00:00:42', '2012-01-01 00:00:43',
               '2012-01-01 00:00:44', '2012-01-01 00:00:45',
               '2012-01-01 00:00:46', '2012-01-01 00:00:47',
               '2012-01-01 00:00:48', '2012-01-01 00:00:49',
               '2012-01-01 00:00:50', '2012-01-01 00:00:51',
               '2012-01-01 00:00:52', '2012-01-01 00:00:53',
               '2012-01-01 00:00:54', '2012-01-01 00:00:55',
               '2012-01-01 00:00:56', '2012-01-01 00:00:57',
               '2012-01-01 00:00:58', '2012-01-01 00:00:59',
               '2012-01-01 00:01:00', '2012-01-01 00:01:01',
               '2012-01-01 00:01:02', '2012-01-01 00:01:03',
               '2012-01-01 00:01:04', '2012-01-01 00:01:05',
               '2012-01-01 00:01:06', '2012-01-01 00:01:07',
               '2012-01-01 00:01:08', '2012-01-01 00:01:09',
               '2012-01-01 00:01:10', '2012-01-01 00:01:11',
               '2012-01-01 00:01:12', '2012-01-01 00:01:13',
               '2012-01-01 00:01:14', '2012-01-01 00:01:15',
               '2012-01-01 00:01:16', '2012-01-01 00:01:17',
               '2012-01-01 00:01:18', '2012-01-01 00:01:19',
               '2012-01-01 00:01:20', '2012-01-01 00:01:21',
               '2012-01-01 00:01:22', '2012-01-01 00:01:23',
               '2012-01-01 00:01:24', '2012-01-01 00:01:25',
               '2012-01-01 00:01:26', '2012-01-01 00:01:27',
               '2012-01-01 00:01:28', '2012-01-01 00:01:29',
               '2012-01-01 00:01:30', '2012-01-01 00:01:31',
               '2012-01-01 00:01:32', '2012-01-01 00:01:33',
               '2012-01-01 00:01:34', '2012-01-01 00:01:35',
               '2012-01-01 00:01:36', '2012-01-01 00:01:37',
               '2012-01-01 00:01:38', '2012-01-01 00:01:39'],
              dtype='datetime64[ns]', freq='s')

In [132]:
ts = pd.Series(np.random.randint(0, 500, len(rng)), index=rng)
ts

2012-01-01 00:00:00    499
2012-01-01 00:00:01    377
2012-01-01 00:00:02     83
2012-01-01 00:00:03    125
2012-01-01 00:00:04     50
                      ...
2012-01-01 00:01:35     12
2012-01-01 00:01:36    291
2012-01-01 00:01:37    181
2012-01-01 00:01:38     26
2012-01-01 00:01:39    169
Freq: s, Length: 100, dtype: int32

In [133]:
ts.resample("5Min").sum()

2012-01-01    25083
Freq: 5min, dtype: int32

**Series.tz_localize()** localizes a time series to a time zone:

In [134]:
rng = pd.date_range("3/6/2012 00:00", periods=5, freq="D")
ts = pd.Series(np.random.randn(len(rng)), rng)
ts

2012-03-06    0.212970
2012-03-07    0.265161
2012-03-08    0.622288
2012-03-09    2.020958
2012-03-10    1.467058
Freq: D, dtype: float64

In [136]:
ts_utc = ts.tz_localize("UTC")
ts_utc

2012-03-06 00:00:00+00:00    0.212970
2012-03-07 00:00:00+00:00    0.265161
2012-03-08 00:00:00+00:00    0.622288
2012-03-09 00:00:00+00:00    2.020958
2012-03-10 00:00:00+00:00    1.467058
Freq: D, dtype: float64

**Series.tz_convert()** converts a timezones aware time series to another time zone:

In [137]:
ts_utc.tz_convert("US/Eastern")

2012-03-05 19:00:00-05:00    0.212970
2012-03-06 19:00:00-05:00    0.265161
2012-03-07 19:00:00-05:00    0.622288
2012-03-08 19:00:00-05:00    2.020958
2012-03-09 19:00:00-05:00    1.467058
Freq: D, dtype: float64

Adding a non-fixed duration (BusinessDay) to a time series:

In [138]:
rng

DatetimeIndex(['2012-03-06', '2012-03-07', '2012-03-08', '2012-03-09',
               '2012-03-10'],
              dtype='datetime64[ns]', freq='D')

In [139]:
rng + pd.offsets.BusinessDay(5)

DatetimeIndex(['2012-03-13', '2012-03-14', '2012-03-15', '2012-03-16',
               '2012-03-16'],
              dtype='datetime64[ns]', freq=None)

## Categoricals
pandas can include categorical data in a DataFrame.

In [141]:
df = pd.DataFrame(
    {"id": [1, 2, 3, 4, 5, 6], "raw_grade": ["a", "b", "b", "a", "a", "e"]}
)
df

   id raw_grade
0   1         a
1   2         b
2   3         b
3   4         a
4   5         a
5   6         e

Converting the raw grades to a categorical data type:

In [142]:
df["grade"] = df["raw_grade"].astype("category")
df["grade"]

0    a
1    b
2    b
3    a
4    a
5    e
Name: grade, dtype: category
Categories (3, object): ['a', 'b', 'e']

Rename the categories to more meaningful names:

In [143]:
new_categories = ["very good", "good", "very bad"]
df["grade"] = df["grade"].cat.rename_categories(new_categories)

In [144]:
df

   id raw_grade      grade
0   1         a  very good
1   2         b       good
2   3         b       good
3   4         a  very good
4   5         a  very good
5   6         e   very bad

Reorder the categories and simultaneously add the missing categories (methods under **Series.cat()** return a new Series by default):

In [145]:
df["grade"] = df["grade"].cat.set_categories(
    ["very bad", "bad", "medium", "good", "very good"]
)
df["grade"]

0    very good
1         good
2         good
3    very good
4    very good
5     very bad
Name: grade, dtype: category
Categories (5, object): ['very bad', 'bad', 'medium', 'good', 'very good']

Sorting is per order in the categories, not lexical order:

In [146]:
df.sort_values(by="grade")

   id raw_grade      grade
5   6         e   very bad
1   2         b       good
2   3         b       good
0   1         a  very good
3   4         a  very good
4   5         a  very good

Grouping by a categorical column with **observed=False** also shows empty categories:

In [147]:
df.groupby("grade", observed=False).size()

grade
very bad     1
bad          0
medium       0
good         2
very good    3
dtype: int64

## Importing and exporting data
## CSV

Writing to a csv file: using **DataFrame.to_csv()**

In [148]:
df = pd.DataFrame(np.random.randint(0, 5, (10, 5)))
df.to_csv("foo.csv")

Reading from a csv file: using **read_csv()**

In [149]:
pd.read_csv("foo.csv")

   Unnamed: 0  0  1  2  3  4
0           0  0  3  3  0  1
1           1  3  4  2  1  2
2           2  1  0  4  4  2
3           3  2  2  3  2  1
4           4  0  4  0  2  2
5           5  3  0  3  3  4
6           6  3  1  3  1  1
7           7  3  0  0  2  0
8           8  2  0  4  1  4
9           9  2  4  3  3  1

## Excel
Writing to an excel file using **DataFrame.to_excel()**:

In [151]:
df.to_excel("foo.xlsx", sheet_name="Sheet1")

Reading from an excel file using **read_excel()**:

In [152]:
pd.read_excel("foo.xlsx", "Sheet1", index_col=None, na_values=["NA"])

   Unnamed: 0  0  1  2  3  4
0           0  0  3  3  0  1
1           1  3  4  2  1  2
2           2  1  0  4  4  2
3           3  2  2  3  2  1
4           4  0  4  0  2  2
5           5  3  0  3  3  4
6           6  3  1  3  1  1
7           7  3  0  0  2  0
8           8  2  0  4  1  4
9           9  2  4  3  3  1